//Расчитана до 4 индикаторов, соеденённых напрямую либо через микруху hc595
#include "max.h"

void DataLSD (s16, u8, u8, u8, u8); //формируем число на экране. s16- число signed int  u8-проставляем точки 
void UpdateLSD (void); // включаем следующий модуль (цифру) (0-обновляем медленно,но всю цифру сразу. 1-обновление по сегментику мин1000Гц)
void InitLSD (void);

//#define HC595 // если через микруху то определяем ее, если напрямую то комментируем!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
#define N_INDICATORS 2 //количество индикаторов
#define SEGMENT_UPDATE // обновление посегментно. тускло,долго, но одинаковая яркость. закоментировать, если нужно обновление индикатора целиком

#define LA PD_ODR_ODR5//  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
#define LB PD_ODR_ODR4//  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
#define LC PD_ODR_ODR3//  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
#define LD PD_ODR_ODR2//  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
#define LE PC_ODR_ODR7//  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
#define LF PC_ODR_ODR6//  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
#define LG PC_ODR_ODR5//  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
#define LH PC_ODR_ODR4//  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

#define G3 PC_ODR_ODR3//  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
#define G2 PB_ODR_ODR4//  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
#define G1 PA_ODR_ODR3//  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
#define G0 PB_ODR_ODR5//  !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!! 

#if defined(HC595) // если через микруху то только 3 вывода
  #define E_595
  #define RS_595
  #define RW_595
#else  
  #define INIT_A PD_DDR_DDR5 = 1; PD_CR1_C15 = 1; PD_CR2_C25 = 0 // out ; push pull ; 2mhz  A !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
  #define INIT_B PD_DDR_DDR4 = 1; PD_CR1_C14 = 1; PD_CR2_C24 = 0 // out ; push pull ; 2mhz  B !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
  #define INIT_C PD_DDR_DDR3 = 1; PD_CR1_C13 = 1; PD_CR2_C23 = 0 // out ; push pull ; 2mhz  C !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
  #define INIT_D PD_DDR_DDR2 = 1; PD_CR1_C12 = 1; PD_CR2_C22 = 0 // out ; push pull ; 2mhz  D !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
  #define INIT_E PC_DDR_DDR7 = 1; PC_CR1_C17 = 1; PC_CR2_C27 = 0 // out ; push pull ; 2mhz  E !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
  #define INIT_F PC_DDR_DDR6 = 1; PC_CR1_C16 = 1; PC_CR2_C26 = 0 // out ; push pull ; 2mhz  F !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
  #define INIT_G PC_DDR_DDR5 = 1; PC_CR1_C15 = 1; PC_CR2_C25 = 0 // out ; push pull ; 2mhz  G !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
  #define INIT_H PC_DDR_DDR4 = 1; PC_CR1_C14 = 1; PC_CR2_C24 = 0 // out ; push pull ; 2mhz  H !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
#endif

#define INIT_G3 PC_DDR_DDR3 = 1; PC_CR1_C13 = 0; PC_CR2_C23 = 0; //  out ; OpenDrain ; G3
#define INIT_G2 PB_DDR_DDR4 = 1; PB_CR1_C14 = 0; PB_CR2_C24 = 0; //  out ; OpenDrain ; G2
#define INIT_G1 PA_DDR_DDR3 = 1; PA_CR1_C13 = 0; PA_CR2_C23 = 0; //  out ; OpenDrain ; G1 !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
#define INIT_G0 PB_DDR_DDR5 = 1; PB_CR1_C15 = 0; PB_CR2_C25 = 0; //  out ; OpenDrain ; G0 !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!



