#include "temperature.h"
#include "max.h"
#include "iostm8s003f3.h"  
//расчитано на R=51KOm

//--var-------------------------------------------------------------------------
float a,b; // коэфициенты T=a*ADC+b
u8 i;

//--function--------------------------------------------------------------------  
void InitTemperature (void)
{
  ADC_CSR_EOCIE = 0;//interrupt off
  ADC_CSR_CH = TCHANEL;   //adc chanel = TCHANEL                                            ///выбор канала
  ADC_CR1_SPSEL = 0;//f = Fmaster/2  и еще 14 тактов на измерение 
  ADC_CR1_CONT = 0; //not continuos
  ADC_CR2_ALIGN = 1;//right align
  ADC_TDRH = 0;     //off schmitt trigger
  ADC_TDRL = 0; 
  ADC_CR1_ADON = 1; //wake up ADC  
};
//---
float ADCtoTemperature(u16 ADC)
{
  if (ADC < 1024)  {a= -1.478399125 ; b=1454.988057 ; }; // ваще ппц холодно
  if (ADC < 1011)  {a= -1.478399125 ; b=1454.988057 ; }; // -40
  if (ADC < 999 )  {a=-0.7952227284 ; b=764.1458233 ; }; // -30
  if (ADC < 977 )  {a=-0.4587666137 ; b=428.1453436 ; }; // -20
  if (ADC < 942 )  {a=-0.2845136819 ; b=257.9266798 ; }; // -10 
  if (ADC < 889 )  {a=-0.1907487878 ; b=169.6282311 ; }; // -0
  if (ADC < 817 )  {a=-0.1393096897 ; b=123.8846994 ; }; // 10
  if (ADC < 728 )  {a=-0.1116350379 ; b=101.2608646 ; }; // 20 
  if (ADC < 626 )  {a=-0.0985241954 ; b=91.71728028 ; }; // 30
  if (ADC < 522 )  {a=-0.0955473583 ; b=89.85253744 ; }; // 40
  if (ADC < 423 )  {a=-0.1009122742 ; b=92.65172180 ; }; // 50
  if (ADC < 335 )  {a=-0.1144531516 ; b=98.37492783 ; }; // 60
  if (ADC < 262 )  {a=-0.1371564974 ; b=105.9871188 ; }; // 70
  if (ADC < 204 )  {a=-0.1709553988 ; b=114.8552739 ; }; // 80
  if (ADC < 158 )  {a=-0.2186637187 ; b=124.5822937 ; }; // 90 
  if (ADC < 123 )  {a=-0.2839860164 ; b=134.9132023 ; }; // 100
  if (ADC < 96  )  {a=-0.3715697086 ; b=145.6807295 ; }; // 110
  if (ADC < 75  )  {a=-0.4870811364 ; b=156.7729470 ; }; // 120
  if (ADC < 60  )  {a=-0.6372949510 ; b=168.1135723 ; }; // 130
  if (ADC < 48  )  {a=-0.8301903279 ; b=179.6497250 ; }; // 140
  if (ADC < 38  )  {a=-1.0750497740 ; b=191.3441635 ; }; // 150
  
  return (a*ADC+b);
};
//---
float TemperatureMeasuring(u8 N)
{ u16 ADC = 0;

  for (u16 i=0; i<(1<<N);i++)
  {
    ADC_CR1_ADON = 1;// запуск измерения
    while (!ADC_CSR_EOC) {};//ждем преобразования ; 
    ADC_CSR_EOC = 0 ; //обнуляем флаг готовности преобразования
    ADC += ADC_DRL;
    ADC += (ADC_DRH)<<8;
  };
  ADC=(ADC>>N);
  return(ADCtoTemperature(ADC));
};